zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBHD_A_Registers.h
//------------------------------------------------------------------------------
// Copyright 2012 (c) Silicon Laboratories Inc.
//
// SPDX-License-Identifier: Zlib
//
// This siHAL software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.
//------------------------------------------------------------------------------
//
// This file applies to the SIM3C1XX_PBHD_A module
//
// Script: 0.57
// Version: 1

#ifndef __SI32_PBHD_A_REGISTERS_H__
#define __SI32_PBHD_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_PBHD_A_PB_Struct
{
   union
   {
      struct
      {
         // Output Latch
         volatile uint32_t PB_BITS: 6;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PB_PB_MASK  0x0000003F
#define SI32_PBHD_A_PB_PB_SHIFT  0



struct SI32_PBHD_A_PBPIN_Struct
{
   union
   {
      struct
      {
         // Pin Value
         volatile uint32_t PBPIN_BITS: 6;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBPIN_PBPIN_MASK  0x0000003F
#define SI32_PBHD_A_PBPIN_PBPIN_SHIFT  0



struct SI32_PBHD_A_PBMDSEL_Struct
{
   union
   {
      struct
      {
         // Mode Select
         volatile uint32_t PBMDSEL_BITS: 6;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBMDSEL_PBMDSEL_MASK  0x0000003F
#define SI32_PBHD_A_PBMDSEL_PBMDSEL_SHIFT  0



struct SI32_PBHD_A_PBDEN_Struct
{
   union
   {
      struct
      {
         // Port Bank N-Channel Driver Enable
         volatile uint32_t PBNDEN: 6;
                  uint32_t reserved0: 10;
         // Port Bank P-Channel Driver Enable
         volatile uint32_t PBPDEN: 6;
                  uint32_t reserved1: 10;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBDEN_PBNDEN_MASK  0x0000003F
#define SI32_PBHD_A_PBDEN_PBNDEN_SHIFT  0

#define SI32_PBHD_A_PBDEN_PBPDEN_MASK  0x003F0000
#define SI32_PBHD_A_PBDEN_PBPDEN_SHIFT  16



struct SI32_PBHD_A_PBDRV_Struct
{
   union
   {
      struct
      {
         // Drive Strength
         volatile uint32_t PBDRV_BITS: 6;
                  uint32_t reserved0: 10;
         // Port Bank Weak Pull-up Enable
         volatile uint32_t PBPUEN: 1;
         // Port Low Voltage Mode
         volatile uint32_t PBLVMD: 1;
         // Port Slew Control
         volatile uint32_t PBSLEW: 2;
                  uint32_t reserved1: 1;
         // Port Bias Enable
         volatile uint32_t PBBIASEN: 1;
         // Port Drive Enable
         volatile uint32_t PBDRVEN: 1;
         // Port Voltage Supply Tracking Enable
         volatile uint32_t PBVTRKEN: 1;
                  uint32_t reserved2: 8;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBDRV_PBDRV_MASK  0x0000003F
#define SI32_PBHD_A_PBDRV_PBDRV_SHIFT  0

#define SI32_PBHD_A_PBDRV_PBPUEN_MASK  0x00010000
#define SI32_PBHD_A_PBDRV_PBPUEN_SHIFT  16
// Disable weak pull-ups for this port.
#define SI32_PBHD_A_PBDRV_PBPUEN_DISABLED_VALUE  0
#define SI32_PBHD_A_PBDRV_PBPUEN_DISABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBPUEN_DISABLED_VALUE << SI32_PBHD_A_PBDRV_PBPUEN_SHIFT)
// Enable weak pull-ups for this port.
#define SI32_PBHD_A_PBDRV_PBPUEN_ENABLED_VALUE  1
#define SI32_PBHD_A_PBDRV_PBPUEN_ENABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBPUEN_ENABLED_VALUE << SI32_PBHD_A_PBDRV_PBPUEN_SHIFT)

#define SI32_PBHD_A_PBDRV_PBLVMD_MASK  0x00020000
#define SI32_PBHD_A_PBDRV_PBLVMD_SHIFT  17
// Port configured for normal mode.
#define SI32_PBHD_A_PBDRV_PBLVMD_NORMAL_VALUE  0
#define SI32_PBHD_A_PBDRV_PBLVMD_NORMAL_U32 \
   (SI32_PBHD_A_PBDRV_PBLVMD_NORMAL_VALUE << SI32_PBHD_A_PBDRV_PBLVMD_SHIFT)
// Port configured for low power mode.
#define SI32_PBHD_A_PBDRV_PBLVMD_LOW_VALUE  1
#define SI32_PBHD_A_PBDRV_PBLVMD_LOW_U32 \
   (SI32_PBHD_A_PBDRV_PBLVMD_LOW_VALUE << SI32_PBHD_A_PBDRV_PBLVMD_SHIFT)

#define SI32_PBHD_A_PBDRV_PBSLEW_MASK  0x000C0000
#define SI32_PBHD_A_PBDRV_PBSLEW_SHIFT  18
// Select the fastest transition speed for this port bank.
#define SI32_PBHD_A_PBDRV_PBSLEW_FASTEST_VALUE  0
#define SI32_PBHD_A_PBDRV_PBSLEW_FASTEST_U32 \
   (SI32_PBHD_A_PBDRV_PBSLEW_FASTEST_VALUE << SI32_PBHD_A_PBDRV_PBSLEW_SHIFT)
// Select the faster transition speed for this port bank.
#define SI32_PBHD_A_PBDRV_PBSLEW_FASTER_VALUE  1
#define SI32_PBHD_A_PBDRV_PBSLEW_FASTER_U32 \
   (SI32_PBHD_A_PBDRV_PBSLEW_FASTER_VALUE << SI32_PBHD_A_PBDRV_PBSLEW_SHIFT)
// Select the slower transition speed for this port bank.
#define SI32_PBHD_A_PBDRV_PBSLEW_SLOWER_VALUE  2
#define SI32_PBHD_A_PBDRV_PBSLEW_SLOWER_U32 \
   (SI32_PBHD_A_PBDRV_PBSLEW_SLOWER_VALUE << SI32_PBHD_A_PBDRV_PBSLEW_SHIFT)
// Select the slowest transition speed for this port bank.
#define SI32_PBHD_A_PBDRV_PBSLEW_SLOWEST_VALUE  3
#define SI32_PBHD_A_PBDRV_PBSLEW_SLOWEST_U32 \
   (SI32_PBHD_A_PBDRV_PBSLEW_SLOWEST_VALUE << SI32_PBHD_A_PBDRV_PBSLEW_SHIFT)

#define SI32_PBHD_A_PBDRV_PBBIASEN_MASK  0x00200000
#define SI32_PBHD_A_PBDRV_PBBIASEN_SHIFT  21
// Disable the biasing to the port pins.
#define SI32_PBHD_A_PBDRV_PBBIASEN_DISABLED_VALUE  0
#define SI32_PBHD_A_PBDRV_PBBIASEN_DISABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBBIASEN_DISABLED_VALUE << SI32_PBHD_A_PBDRV_PBBIASEN_SHIFT)
// Enable the biasing to the port pins.
#define SI32_PBHD_A_PBDRV_PBBIASEN_ENABLED_VALUE  1
#define SI32_PBHD_A_PBDRV_PBBIASEN_ENABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBBIASEN_ENABLED_VALUE << SI32_PBHD_A_PBDRV_PBBIASEN_SHIFT)

