zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBHD_A_Registers.h
#define SI32_PBHD_A_PBDRV_PBDRVEN_MASK  0x00400000
#define SI32_PBHD_A_PBDRV_PBDRVEN_SHIFT  22
// Disable the port drivers.
#define SI32_PBHD_A_PBDRV_PBDRVEN_DISABLED_VALUE  0
#define SI32_PBHD_A_PBDRV_PBDRVEN_DISABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBDRVEN_DISABLED_VALUE << SI32_PBHD_A_PBDRV_PBDRVEN_SHIFT)
// Enable the port drivers.
#define SI32_PBHD_A_PBDRV_PBDRVEN_ENABLED_VALUE  1
#define SI32_PBHD_A_PBDRV_PBDRVEN_ENABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBDRVEN_ENABLED_VALUE << SI32_PBHD_A_PBDRV_PBDRVEN_SHIFT)

#define SI32_PBHD_A_PBDRV_PBVTRKEN_MASK  0x00800000
#define SI32_PBHD_A_PBDRV_PBVTRKEN_SHIFT  23
// Disable VIOHD tracking.
#define SI32_PBHD_A_PBDRV_PBVTRKEN_DISABLED_VALUE  0
#define SI32_PBHD_A_PBDRV_PBVTRKEN_DISABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBVTRKEN_DISABLED_VALUE << SI32_PBHD_A_PBDRV_PBVTRKEN_SHIFT)
// Enable VIOHD tracking.
#define SI32_PBHD_A_PBDRV_PBVTRKEN_ENABLED_VALUE  1
#define SI32_PBHD_A_PBDRV_PBVTRKEN_ENABLED_U32 \
   (SI32_PBHD_A_PBDRV_PBVTRKEN_ENABLED_VALUE << SI32_PBHD_A_PBDRV_PBVTRKEN_SHIFT)



struct SI32_PBHD_A_PBILIMIT_Struct
{
   union
   {
      struct
      {
         // Current Limit Enable
         volatile uint32_t PBILEN: 6;
                  uint32_t reserved0: 10;
         // N-Channel Current Limit
         volatile uint32_t NILIMIT: 4;
         // P-Channel Current Limit
         volatile uint32_t PILIMIT: 4;
                  uint32_t reserved1: 8;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBILIMIT_PBILEN_MASK  0x0000003F
#define SI32_PBHD_A_PBILIMIT_PBILEN_SHIFT  0

#define SI32_PBHD_A_PBILIMIT_NILIMIT_MASK  0x000F0000
#define SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT  16
// Set sink limit to mode 0.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE0_VALUE  0
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE0_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE0_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 1.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE1_VALUE  1
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE1_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE1_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 2.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE2_VALUE  2
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE2_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE2_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 3.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE3_VALUE  3
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE3_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE3_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 4.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE4_VALUE  4
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE4_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE4_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 5.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE5_VALUE  5
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE5_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE5_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 6.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE6_VALUE  6
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE6_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE6_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 7.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE7_VALUE  7
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE7_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE7_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 8.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE8_VALUE  8
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE8_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE8_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 9.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE9_VALUE  9
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE9_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE9_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 10.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE10_VALUE  10
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE10_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE10_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 11.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE11_VALUE  11
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE11_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE11_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 12.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE12_VALUE  12
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE12_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE12_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 13.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE13_VALUE  13
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE13_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE13_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 14.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE14_VALUE  14
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE14_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE14_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)
// Set sink limit to mode 15.
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE15_VALUE  15
#define SI32_PBHD_A_PBILIMIT_NILIMIT_MODE15_U32 \
   (SI32_PBHD_A_PBILIMIT_NILIMIT_MODE15_VALUE << SI32_PBHD_A_PBILIMIT_NILIMIT_SHIFT)

#define SI32_PBHD_A_PBILIMIT_PILIMIT_MASK  0x00F00000
#define SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT  20
// Set source limit to mode 0.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE0_VALUE  0
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE0_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE0_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 1.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE1_VALUE  1
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE1_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE1_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 2.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE2_VALUE  2
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE2_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE2_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 3.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE3_VALUE  3
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE3_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE3_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 4.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE4_VALUE  4
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE4_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE4_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 5.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE5_VALUE  5
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE5_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE5_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 6.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE6_VALUE  6
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE6_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE6_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 7.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE7_VALUE  7
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE7_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE7_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 8.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE8_VALUE  8
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE8_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE8_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 9.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE9_VALUE  9
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE9_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE9_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 10.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE10_VALUE  10
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE10_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE10_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 11.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE11_VALUE  11
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE11_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE11_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 12.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE12_VALUE  12
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE12_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE12_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 13.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE13_VALUE  13
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE13_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE13_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 14.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE14_VALUE  14
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE14_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE14_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)
// Set source limit to mode 15.
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE15_VALUE  15
#define SI32_PBHD_A_PBILIMIT_PILIMIT_MODE15_U32 \
   (SI32_PBHD_A_PBILIMIT_PILIMIT_MODE15_VALUE << SI32_PBHD_A_PBILIMIT_PILIMIT_SHIFT)



struct SI32_PBHD_A_PBFSEL_Struct
{
   union
   {
      struct
      {
         // Port Bank n.0 Function Select
         volatile uint32_t PB0SEL: 2;
         // Port Bank n.1 Function Select
         volatile uint32_t PB1SEL: 2;
         // Port Bank n.2 Function Select
         volatile uint32_t PB2SEL: 2;
         // Port Bank n.3 Function Select
         volatile uint32_t PB3SEL: 2;
         // Port Bank n.4 Function Select
         volatile uint32_t PB4SEL: 2;
         // Port Bank n.5 Function Select
         volatile uint32_t PB5SEL: 3;
                  uint32_t reserved0: 19;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBFSEL_PB0SEL_MASK  0x00000003
#define SI32_PBHD_A_PBFSEL_PB0SEL_SHIFT  0
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB0SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB0SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB0SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB0SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB0SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB0SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB0SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB0SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB0SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB0SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB0SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB0SEL_SHIFT)

