zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBHD_A_Registers.h
#define SI32_PBHD_A_PBFSEL_PB1SEL_MASK  0x0000000C
#define SI32_PBHD_A_PBFSEL_PB1SEL_SHIFT  2
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB1SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB1SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB1SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB1SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB1SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB1SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB1SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB1SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB1SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB1SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB1SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB1SEL_SHIFT)

#define SI32_PBHD_A_PBFSEL_PB2SEL_MASK  0x00000030
#define SI32_PBHD_A_PBFSEL_PB2SEL_SHIFT  4
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB2SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB2SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB2SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB2SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB2SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB2SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB2SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB2SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB2SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB2SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB2SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB2SEL_SHIFT)
// Pin configured for UART1 TX.
#define SI32_PBHD_A_PBFSEL_PB2SEL_UART1_VALUE  3
#define SI32_PBHD_A_PBFSEL_PB2SEL_UART1_U32 \
   (SI32_PBHD_A_PBFSEL_PB2SEL_UART1_VALUE << SI32_PBHD_A_PBFSEL_PB2SEL_SHIFT)

#define SI32_PBHD_A_PBFSEL_PB3SEL_MASK  0x000000C0
#define SI32_PBHD_A_PBFSEL_PB3SEL_SHIFT  6
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB3SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB3SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB3SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB3SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB3SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB3SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB3SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB3SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB3SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB3SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB3SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB3SEL_SHIFT)
// Pin configured for UART1 RX.
#define SI32_PBHD_A_PBFSEL_PB3SEL_UART1_VALUE  3
#define SI32_PBHD_A_PBFSEL_PB3SEL_UART1_U32 \
   (SI32_PBHD_A_PBFSEL_PB3SEL_UART1_VALUE << SI32_PBHD_A_PBFSEL_PB3SEL_SHIFT)

#define SI32_PBHD_A_PBFSEL_PB4SEL_MASK  0x00000300
#define SI32_PBHD_A_PBFSEL_PB4SEL_SHIFT  8
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB4SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB4SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB4SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB4SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB4SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB4SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB4SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB4SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB4SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB4SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB4SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB4SEL_SHIFT)
// Pin configured for UART1 RTS.
#define SI32_PBHD_A_PBFSEL_PB4SEL_UART1_VALUE  3
#define SI32_PBHD_A_PBFSEL_PB4SEL_UART1_U32 \
   (SI32_PBHD_A_PBFSEL_PB4SEL_UART1_VALUE << SI32_PBHD_A_PBFSEL_PB4SEL_SHIFT)

#define SI32_PBHD_A_PBFSEL_PB5SEL_MASK  0x00001C00
#define SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT  10
// Pin configured for GPIO.
#define SI32_PBHD_A_PBFSEL_PB5SEL_GPIO_VALUE  0
#define SI32_PBHD_A_PBFSEL_PB5SEL_GPIO_U32 \
   (SI32_PBHD_A_PBFSEL_PB5SEL_GPIO_VALUE << SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT)
// Pin configured for Port Mapped Level Shift.
#define SI32_PBHD_A_PBFSEL_PB5SEL_PMLS_VALUE  1
#define SI32_PBHD_A_PBFSEL_PB5SEL_PMLS_U32 \
   (SI32_PBHD_A_PBFSEL_PB5SEL_PMLS_VALUE << SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT)
// Pin configured for EPCA0 output.
#define SI32_PBHD_A_PBFSEL_PB5SEL_EPCA0_VALUE  2
#define SI32_PBHD_A_PBFSEL_PB5SEL_EPCA0_U32 \
   (SI32_PBHD_A_PBFSEL_PB5SEL_EPCA0_VALUE << SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT)
// Pin configured for UART1 CTS.
#define SI32_PBHD_A_PBFSEL_PB5SEL_UART1_VALUE  3
#define SI32_PBHD_A_PBFSEL_PB5SEL_UART1_U32 \
   (SI32_PBHD_A_PBFSEL_PB5SEL_UART1_VALUE << SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT)
// Pin configured for LPTIMER0 toggle output.
#define SI32_PBHD_A_PBFSEL_PB5SEL_LPTIMER0_VALUE  4
#define SI32_PBHD_A_PBFSEL_PB5SEL_LPTIMER0_U32 \
   (SI32_PBHD_A_PBFSEL_PB5SEL_LPTIMER0_VALUE << SI32_PBHD_A_PBFSEL_PB5SEL_SHIFT)



struct SI32_PBHD_A_PBSS_Struct
{
   union
   {
      struct
      {
         // Port Bank n.0 Safe State Select
         volatile uint32_t PB0SSSEL: 2;
         // Port Bank n.1 Safe State Select
         volatile uint32_t PB1SSSEL: 2;
         // Port Bank n.2 Safe State Select
         volatile uint32_t PB2SSSEL: 2;
         // Port Bank n.3 Safe State Select
         volatile uint32_t PB3SSSEL: 2;
         // Port Bank n.4 Safe State Select
         volatile uint32_t PB4SSSEL: 2;
         // Port Bank n.5 Safe State Select
         volatile uint32_t PB5SSSEL: 2;
                  uint32_t reserved0: 4;
         // Enter Safe State Mode
         volatile uint32_t SSMDEN: 1;
         // Safe State Signal Mode
         volatile uint32_t PBSSSMD: 1;
                  uint32_t reserved1: 14;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBSS_PB0SSSEL_MASK  0x00000003
#define SI32_PBHD_A_PBSS_PB0SSSEL_SHIFT  0
// Place PBn.0 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB0SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB0SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB0SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB0SSSEL_SHIFT)
// Drive PBn.0 High.
#define SI32_PBHD_A_PBSS_PB0SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB0SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB0SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB0SSSEL_SHIFT)
// Drive PBn.0 Low.
#define SI32_PBHD_A_PBSS_PB0SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB0SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB0SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB0SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB0SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB0SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB0SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB0SSSEL_SHIFT)

#define SI32_PBHD_A_PBSS_PB1SSSEL_MASK  0x0000000C
#define SI32_PBHD_A_PBSS_PB1SSSEL_SHIFT  2
// Place PBn.1 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB1SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB1SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB1SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB1SSSEL_SHIFT)
// Drive PBn.1 High.
#define SI32_PBHD_A_PBSS_PB1SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB1SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB1SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB1SSSEL_SHIFT)
// Drive PBn.1 Low.
#define SI32_PBHD_A_PBSS_PB1SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB1SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB1SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB1SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB1SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB1SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB1SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB1SSSEL_SHIFT)

#define SI32_PBHD_A_PBSS_PB2SSSEL_MASK  0x00000030
#define SI32_PBHD_A_PBSS_PB2SSSEL_SHIFT  4
// Place PBn.2 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB2SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB2SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB2SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB2SSSEL_SHIFT)
// Drive PBn.2 High.
#define SI32_PBHD_A_PBSS_PB2SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB2SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB2SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB2SSSEL_SHIFT)
// Drive PBn.2 Low.
#define SI32_PBHD_A_PBSS_PB2SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB2SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB2SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB2SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB2SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB2SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB2SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB2SSSEL_SHIFT)

