zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_PBHD_A_Registers.h
#define SI32_PBHD_A_PBSS_PB3SSSEL_MASK  0x000000C0
#define SI32_PBHD_A_PBSS_PB3SSSEL_SHIFT  6
// Place PBn.3 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB3SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB3SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB3SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB3SSSEL_SHIFT)
// Drive PBn.3 High.
#define SI32_PBHD_A_PBSS_PB3SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB3SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB3SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB3SSSEL_SHIFT)
// Drive PBn.3 Low.
#define SI32_PBHD_A_PBSS_PB3SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB3SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB3SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB3SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB3SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB3SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB3SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB3SSSEL_SHIFT)

#define SI32_PBHD_A_PBSS_PB4SSSEL_MASK  0x00000300
#define SI32_PBHD_A_PBSS_PB4SSSEL_SHIFT  8
// Place PBn.4 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB4SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB4SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB4SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB4SSSEL_SHIFT)
// Drive PBn.4 High.
#define SI32_PBHD_A_PBSS_PB4SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB4SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB4SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB4SSSEL_SHIFT)
// Drive PBn.4 Low.
#define SI32_PBHD_A_PBSS_PB4SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB4SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB4SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB4SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB4SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB4SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB4SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB4SSSEL_SHIFT)

#define SI32_PBHD_A_PBSS_PB5SSSEL_MASK  0x00000C00
#define SI32_PBHD_A_PBSS_PB5SSSEL_SHIFT  10
// Place PBn.5 in a High Impedance state.
#define SI32_PBHD_A_PBSS_PB5SSSEL_HIZ_VALUE  0
#define SI32_PBHD_A_PBSS_PB5SSSEL_HIZ_U32 \
   (SI32_PBHD_A_PBSS_PB5SSSEL_HIZ_VALUE << SI32_PBHD_A_PBSS_PB5SSSEL_SHIFT)
// Drive PBn.5 High.
#define SI32_PBHD_A_PBSS_PB5SSSEL_HIGH_VALUE  1
#define SI32_PBHD_A_PBSS_PB5SSSEL_HIGH_U32 \
   (SI32_PBHD_A_PBSS_PB5SSSEL_HIGH_VALUE << SI32_PBHD_A_PBSS_PB5SSSEL_SHIFT)
// Drive PBn.5 Low.
#define SI32_PBHD_A_PBSS_PB5SSSEL_LOW_VALUE  2
#define SI32_PBHD_A_PBSS_PB5SSSEL_LOW_U32 \
   (SI32_PBHD_A_PBSS_PB5SSSEL_LOW_VALUE << SI32_PBHD_A_PBSS_PB5SSSEL_SHIFT)
// Ignore the safe state signal (weak pull-ups disabled).
#define SI32_PBHD_A_PBSS_PB5SSSEL_DISABLED_VALUE  3
#define SI32_PBHD_A_PBSS_PB5SSSEL_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_PB5SSSEL_DISABLED_VALUE << SI32_PBHD_A_PBSS_PB5SSSEL_SHIFT)

#define SI32_PBHD_A_PBSS_SSMDEN_MASK  0x00010000
#define SI32_PBHD_A_PBSS_SSMDEN_SHIFT  16
// Disable Safe State.
#define SI32_PBHD_A_PBSS_SSMDEN_DISABLED_VALUE  0
#define SI32_PBHD_A_PBSS_SSMDEN_DISABLED_U32 \
   (SI32_PBHD_A_PBSS_SSMDEN_DISABLED_VALUE << SI32_PBHD_A_PBSS_SSMDEN_SHIFT)
// Enter Safe State.  Each PBn.x pin will enter the states defined by PBxSSSEL.
#define SI32_PBHD_A_PBSS_SSMDEN_ENABLED_VALUE  1
#define SI32_PBHD_A_PBSS_SSMDEN_ENABLED_U32 \
   (SI32_PBHD_A_PBSS_SSMDEN_ENABLED_VALUE << SI32_PBHD_A_PBSS_SSMDEN_SHIFT)

#define SI32_PBHD_A_PBSS_PBSSSMD_MASK  0x00020000
#define SI32_PBHD_A_PBSS_PBSSSMD_SHIFT  17
// Enable deglitching on the kill signal input. The kill signal must be asserted
// for two APB clocks to be recognized.
#define SI32_PBHD_A_PBSS_PBSSSMD_DEGLITCH_VALUE  0
#define SI32_PBHD_A_PBSS_PBSSSMD_DEGLITCH_U32 \
   (SI32_PBHD_A_PBSS_PBSSSMD_DEGLITCH_VALUE << SI32_PBHD_A_PBSS_PBSSSMD_SHIFT)
// Disable deglitching on the kill signal input.  The kill signal will take
// immediate effect.
#define SI32_PBHD_A_PBSS_PBSSSMD_IMMEDIATE_VALUE  1
#define SI32_PBHD_A_PBSS_PBSSSMD_IMMEDIATE_U32 \
   (SI32_PBHD_A_PBSS_PBSSSMD_IMMEDIATE_VALUE << SI32_PBHD_A_PBSS_PBSSSMD_SHIFT)



struct SI32_PBHD_A_PBLOCK_Struct
{
   union
   {
      struct
      {
         // Port Bank Lock
         volatile uint32_t PBLOCK_BITS: 6;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBHD_A_PBLOCK_PBLOCK_MASK  0x0000003F
#define SI32_PBHD_A_PBLOCK_PBLOCK_SHIFT  0



typedef struct SI32_PBHD_A_Struct
{
   struct SI32_PBHD_A_PB_Struct                    PB             ; // Base Address + 0x0
   volatile uint32_t                               PB_SET;
   volatile uint32_t                               PB_CLR;
   volatile uint32_t                               PB_MSK;
   struct SI32_PBHD_A_PBPIN_Struct                 PBPIN          ; // Base Address + 0x10
   uint32_t                                        reserved0;
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   struct SI32_PBHD_A_PBMDSEL_Struct               PBMDSEL        ; // Base Address + 0x20
   volatile uint32_t                               PBMDSEL_SET;
   volatile uint32_t                               PBMDSEL_CLR;
   uint32_t                                        reserved3;
   struct SI32_PBHD_A_PBDEN_Struct                 PBDEN          ; // Base Address + 0x30
   volatile uint32_t                               PBDEN_SET;
   volatile uint32_t                               PBDEN_CLR;
   uint32_t                                        reserved4;
   struct SI32_PBHD_A_PBDRV_Struct                 PBDRV          ; // Base Address + 0x40
   volatile uint32_t                               PBDRV_SET;
   volatile uint32_t                               PBDRV_CLR;
   uint32_t                                        reserved5;
   struct SI32_PBHD_A_PBILIMIT_Struct              PBILIMIT       ; // Base Address + 0x50
   volatile uint32_t                               PBILIMIT_SET;
   volatile uint32_t                               PBILIMIT_CLR;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7[4];
   struct SI32_PBHD_A_PBFSEL_Struct                PBFSEL         ; // Base Address + 0x70
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   uint32_t                                        reserved10;
   struct SI32_PBHD_A_PBSS_Struct                  PBSS           ; // Base Address + 0x80
   volatile uint32_t                               PBSS_SET;
   volatile uint32_t                               PBSS_CLR;
   uint32_t                                        reserved11;
   struct SI32_PBHD_A_PBLOCK_Struct                PBLOCK         ; // Base Address + 0x90
   uint32_t                                        reserved12;
   uint32_t                                        reserved13;
   uint32_t                                        reserved14;
} SI32_PBHD_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_PBHD_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

